OpenDTEF-v1812/tutorials/multiphase/interIsoFoam/damBreak/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

restore0Dir

runApplication blockMesh
runApplication decomposePar
runParallel setFields

runParallel $(getApplication)

#------------------------------------------------------------------------------
